[{"sodium":559.0,"directions":["1. Place the stock, lentils, celery, carrot, thyme, and salt in a medium saucepan and bring to a boil. Reduce heat to low and simmer until the lentils are tender, about 30 minutes, depending on the lentils. (If they begin to dry out, add water as needed.) Remove and discard the thyme. Drain and transfer the mixture to a bowl; let cool.","2. Fold in the tomato, apple, lemon juice, and olive oil. Season with the pepper.","3. To assemble a wrap, place 1 lavash sheet on a clean work surface. Spread some of the lentil mixture on the end nearest you, leaving a 1-inch border. Top with several slices of turkey, then some of the lettuce. Roll up the lavash, slice crosswise, and serve. If using tortillas, spread the lentils in the center, top with the turkey and lettuce, and fold up the bottom, left side, and right side before rolling away from you."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/551b0595e7851a541a30b23f\/6:4\/w_620%2Ch_413\/239173_lentil-apple-and-turkey-wrap_6x4.jpg","protein":120.0,"fat":63.0,"ingredients":["4 cups low-sodium vegetable or chicken stock","1 cup dried brown lentils","1\/2 cup dried French green lentils","2 stalks celery, chopped","1 large carrot, peeled and chopped","1 sprig fresh thyme","1 teaspoon kosher salt","1 medium tomato, cored, seeded, and diced","1 small Fuji apple, cored and diced","1 tablespoon freshly squeezed lemon juice","2 teaspoons extra-virgin olive oil","Freshly ground black pepper to taste","3 sheets whole-wheat lavash, cut in half crosswise, or 6 (12-inch) flour tortillas","3\/4 pound turkey breast, thinly sliced","1\/2 head Bibb lettuce"],"calories":426.0,"id":1,"title":"Lentil, Apple, and Turkey Wrap ","labels":["LOWFAT","HIGHPROTEIN"]},{"sodium":1042.0,"directions":["Mix basil, mayonnaise and butter in processor until basil is finely chopped and mixture is well blended. Season to taste with salt and pepper. (Can be made 1 day ahead. Cover and refrigerate.)","Cook bacon in heavy large skillet over medium-high heat until crisp, about 8 minutes. Transfer to paper towels; drain.","Spread half of mayonnaise mixture over 1 side of 6 bread slices. Top each with 2 tomato slices. Sprinkle tomatoes with salt and pepper. Top tomato slices with avocado, then with bacon strips, onion and lettuce. Spread remaining mayonnaise mixture over remaining 6 bread slices. Place bread slices atop lettuce. Cut sandwiches in half and serve."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/5612e5f4928970611e0a8064\/6:4\/w_620%2Ch_413\/101977.jpg","protein":76.0,"fat":711.0,"ingredients":["2 1\/2 cups (lightly packed) fresh basil leaves","1 cup mayonnaise","1\/4 cup butter, room temperature","12 thick-sliced bacon strips (about 1 pound)","12 1\/2-inch-thick slices fresh country-style white bread","3 large tomatoes, cut into 1\/4-inch-thick rounds","2 ripe avocados, pitted, peeled, sliced","1 red onion, thinly sliced","6 lettuce leaves"],"calories":948.0,"id":6,"title":"The Best Blts ","labels":["HIGHFATMODERATEPROTEIN"]},{"sodium":1272.0,"directions":["Stir together soy sauce, sugar, sesame oil, white and pale green scallions, garlic, ginger, and 2 tablespoons sesame seeds in a bowl until sugar is dissolved. Add steak and toss to coat, then marinate 15 minutes.","Heat vegetable oil in a 12-inch heavy skillet over high heat until just smoking, then add steak in 1 layer and sauté, turning over occasionally, until browned and just cooked through, about 5 minutes total. Transfer to a platter and sprinkle with scallion greens and remaining 1 tablespoon sesame seeds, then serve with accompaniments.","*Available at Asian markets and many supermarkets."],"imageURL":"","protein":28.0,"fat":90.0,"ingredients":["1\/4 cup soy sauce","1 tablespoon sugar","2 teaspoons Asian sesame oil","1 bunch scallions (white and pale green parts separated from greens), minced (1\/2 cup)","1 tablespoon minced garlic","1 tablespoon minced peeled fresh ginger","3 tablespoons sesame seeds, toasted","1 lb flank steak, cut across the grain into very thin slices (no more than 1\/8 inch thick)","1 tablespoon vegetable oil","Accompaniments: butter lettuce or other soft-leaf lettuce; thinly sliced garlic; packaged kimchi*; steamed white rice"],"calories":170.0,"id":9,"title":"Korean Marinated Beef ","labels":["LOWCALORIE","HIGHPROTEIN"]},{"sodium":1696.0,"directions":["Chop enough parsley leaves to measure 1 tablespoon; reserve. Chop remaining leaves and stems and simmer with broth and garlic in a small saucepan, covered, 5 minutes.","Meanwhile, sprinkle gelatin over water in a medium bowl and let soften 1 minute. Strain broth through a fine-mesh sieve into bowl with gelatin and stir to dissolve. Season with salt and pepper. Set bowl in an ice bath and cool to room temperature, stirring.","Toss ham with reserved parsley and divide among jars. Pour gelatin on top and chill until set, at least 1 hour.","Whisk together mayonnaise, mustard, vinegar, 1\/4 teaspoon salt, and 1\/4 teaspoon pepper in a large bowl. Stir in celery, cornichons, and potatoes.","Pulse peas with marjoram, oil, 1\/2 teaspoon pepper, and 1\/4 teaspoon salt in a food processor to a coarse mash.","Layer peas, then potato salad, over ham."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/560d78e67b55306961bf3501\/6:4\/w_620%2Ch_413\/243208_hires.jpg","protein":92.0,"fat":369.0,"ingredients":["6 long parsley sprigs, divided","1 3\/4 cups reduced-sodium chicken broth","1 large garlic clove, minced","2 teaspoon unflavored gelatin (from 1 envelope)","3 tablespoons water","1 (3\/4-pound) piece baked ham, cut into 1\/2-inch cubes (2 cups)","1\/2 cup mayonnaise","2 tablespoons Dijon mustard","2 tablespoons white-wine vinegar","2 celery ribs, finely chopped (1 cup)","1\/4 cup chopped cornichons or sour gherkins","1 pound boiled potatoes, peeled and cut into 1\/2-inch cubes (2 1\/2 cups)","1 (10-ounce) box frozen baby peas, thawed","2 teaspoons finely chopped marjoram","3 tablespoons extra-virgin olive oil","Equipment: 4 (16-ounce) wide jars or containers with lids","Garnish: celery leaves"],"calories":602.0,"id":10,"title":"Ham Persillade with Mustard Potato Salad and Mashed Peas ","labels":["HIGHPROTEIN"]},{"sodium":439.0,"directions":["Preheat oven to 350°F. Coat cake pans with nonstick spray. Line bottom of pans with parchment; coat paper. Whisk flour, baking soda, and salt in a medium bowl. Using an electric mixer, beat sugar, butter, and brown sugar in a large bowl until light and fluffy, about 3 minutes. Add eggs one at a time, beating to blend between additions and occasionally scraping down sides and bottom of bowl. Beat in vanilla.","Add dry ingredients; beat on low speed just to blend. Add bananas and sour cream; beat just to blend. Fold in mini chips. Divide batter evenly among pans; smooth tops.","Bake cakes until a tester inserted into the center comes out clean, about 35 minutes. Transfer to wire racks; let cool in pans for 10 minutes. Invert cakes onto racks; peel off parchment and let cool completely.","Using an electric mixer, beat first 4 ingredients in a medium bowl until a light and fluffy frosting forms, 2-3 minutes.","Place 1 cake on a platter. Spread 1 1\/4 cups frosting over. Place remaining cake on top. Cover top and sides of cake with remaining frosting. Garnish with chocolate chips and kisses. DO AHEAD: Cake can be made 2 days ahead. Cover and chill. Let stand at room temperature for 1 hour before serving."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/54b081441cc76a014cfaa129\/6:4\/w_620%2Ch_413\/51117350_banana-chocolate-chip-cake_1x1.jpg","protein":48.0,"fat":432.0,"ingredients":["Nonstick vegetable oil spray","3 cups all-purpose flour","2 teaspoons baking soda","2 teaspoons kosher salt","1 1\/2 cups sugar","1 cup (2 sticks) unsalted butter, room temperature","1\/2 cup (packed) light brown sugar","3 large eggs","1 1\/2 teaspoons vanilla extract","2 cups mashed very ripe bananas","1 cup sour cream","1 10-ounce bag mini chocolate chips","2 cups creamy peanut butter","1 1\/2 cups powdered sugar","1 cup (2 sticks) unsalted butter, room temperature","2 1\/2 teaspoons vanilla extract","Chocolate chips, mini chocolate chips, and chocolate kisses","Two 8x8x2\" cake pans"],"calories":766.0,"id":13,"title":"Banana-Chocolate Chip Cake With Peanut Butter Frosting ","labels":["HIGHFATMODERATEPROTEIN"]},{"sodium":176.0,"directions":["Sprinkle steaks with salt and pepper. Heat oil in large skillet over medium-high heat. Add steaks; cook to desired doneness, about 5 minutes per side for medium-rare. Transfer steaks to platter. Add 2 tablespoons parsley and garlic to skillet; stir 30 seconds. Add broth, then brandy. Boil until juices are reduced to glaze, about 6 minutes. Spoon glaze over steaks. Sprinkle with remaining 1 tablespoon parsley."],"imageURL":"","protein":44.0,"fat":108.0,"ingredients":["4 6- to 7-ounce beef tenderloin steaks (each about 1 inch thick)","1 tablespoon olive oil","3 tablespoons chopped fresh parsley","3 large garlic cloves, chopped","2\/3 cup canned beef broth","2 tablespoons brandy"],"calories":174.0,"id":14,"title":"Beef Tenderloin with Garlic and Brandy ","labels":["LOWSODIUM","LOWCALORIE","HIGHPROTEIN"]},{"sodium":1394.0,"directions":["Using the tip of a paring knife, score an X in the bottom of peach. Cook in a small saucepan of boiling water just until skin begins to peel back where cut, about 30 seconds. Transfer to a bowl of ice water; let cool. Peel and coarsely chop.","Bring peach, sugar, vinegar, 1\/2 teaspoon salt, and 2 tablespoons water to a boil in a small saucepan. Reduce heat and simmer, stirring occasionally, until peach is very soft and mixture thickens slightly, 5–8 minutes. Pulse in a blender until chunky (do not purée). Transfer to a medium bowl; let cool.","Mix in Dijon and whole grain mustards and chives; season with salt and pepper."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/5f3c19c210f07afdd8da5da2\/6:4\/w_620%2Ch_413\/PeachBaconPanzanella_HERO_RECIPE_081220_10724_V1_final.jpg","protein":16.0,"fat":27.0,"ingredients":["1 large ripe peach","2 tablespoons sugar","1 teaspoon apple cider vinegar","1\/2 teaspoon kosher salt, plus more","1\/3 cup Dijon mustard","1\/3 cup whole grain mustard","1 tablespoon finely chopped fresh chives","Freshly ground black pepper"],"calories":134.0,"id":15,"title":"Peach Mustard ","labels":["LOWFAT","LOWCALORIE"]},{"sodium":160.0,"directions":["Butter and sugar six 2\/3-to 3\/4-cup ramekins. Bring 1 cup water and next 5 ingredients just to boil in medium saucepan, stirring occasionally. Gradually whisk in cornmeal. Reduce heat to low; stir until mixture is thick and creamy, about 2 minutes. Remove from heat. Stir in yolks.","Beat egg whites and cream of tartar in medium bowl until soft peaks form. Stir 1\/3 of whites into cornmeal mixture. Fold in remaining whites in 2 additions. Divide among ramekins. Place on rimmed baking sheet. DO AHEAD: Can be made 1 day ahead. Cover; chill.","Preheat oven to 375°F. Bake spoon breads until almost set in center, about 22 minutes (26 minutes if chilled). Serve immediately with strawberry preserves."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/560d79a6f3a00aeb2f1cb853\/6:4\/w_620%2Ch_413\/351045_hires.jpg","protein":16.0,"fat":45.0,"ingredients":["1 cup water","2\/3 cup buttermilk","1\/3 cup heavy whipping cream","2 tablespoons plus 2 teaspoons sugar","1\/2 teaspoon honey","1\/4 teaspoon (scant) coarse kosher salt","2\/3 cup white cornmeal (not white grits)","2 large eggs, separated","Pinch of cream of tartar","Strawberry preserves"],"calories":146.0,"id":17,"title":"Sweet Buttermilk Spoon Breads ","labels":["LOWSODIUM","LOWCALORIE"]},{"sodium":383.0,"directions":["Puree first 5 ingredients in blender until smooth. With machine running, gradually add vegetable oil, then olive oil. Season to taste with salt and pepper. DO AHEAD: Can be made 1 day ahead. Cover and chill.","Cook asparagus in large skillet of boiling salted water until just tender, 4 to 5 minutes. Transfer asparagus to 13x9x2-inch pan of ice water to cool. Drain asparagus and pat dry. DO AHEAD: Can be made 8 hours ahead. Wrap in paper towels, then plastic, and chill.","Place potatoes in large saucepan. Add enough water to cover potatoes by 1 inch. Sprinkle with salt. Bring to boil and cook until potatoes are tender, 10 to 15 minutes, depending on size of potatoes. Drain; let cool 5 minutes. Place in medium bowl. Add 1\/4 cup vinaigrette; toss to coat. Season to taste with salt and pepper.","Heat olive oil in small skillet over medium-high heat. Add capers and fry until capers are crisp and open like flowers, stirring often, 45 to 60 seconds. Using slotted spoon, transfer capers to paper towels to drain. DO AHEAD: Potatoes and capers can be made 2 hours ahead. Let stand at room temperature.","Place asparagus in large bowl. Add 2 tablespoons vinaigrette and toss to coat. Toss potatoes again to coat, adding 1 more tablespoon vinaigrette if dry. Place greens and radishes in another large bowl. Toss with enough vinaigrette to coat. Spread greens and radishes over large platter. Arrange potatoes, asparagus, eggs, and tuna atop greens. Drizzle some vinaigrette over tuna. Sprinkle with fried capers and chive blossoms, if desired."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/5554f551644d45515b75301c\/6:4\/w_620%2Ch_413\/6x4.jpg","protein":40.0,"fat":297.0,"ingredients":["1\/3 cup chopped fresh chives","1\/4 cup Champagne vinegar","1 small shallot, coarsely chopped","1 teaspoon honey","1 teaspoon Dijon mustard","2\/3 cup vegetable oil","1\/3 cup extra-virgin olive oil","1 1\/2 pounds thick asparagus, stems peeled","1 1\/4 pounds baby red potatoes, halved or quartered","1\/3 cup olive oil","1\/2 cup capers, drained, patted dry","8 ounces mixed spring greens","16 large radishes, trimmed, very thinly sliced (about 3 cups)","3 large hard-boiled eggs, peeled, quartered","12 ounces imported tuna packed in oil, drained","Chive blossoms (optional)"],"calories":421.0,"id":20,"title":"Tuna, Asparagus, and New Potato Salad with Chive Vinaigrette and Fried Capers ","labels":["HIGHFATMODERATEPROTEIN"]},{"sodium":206.0,"directions":["Preheat oven to 325°F. Toss pecans and melted butter in medium bowl to coat. Add sea salt and toss. Spread pecans in single layer on rimmed baking sheet.","Bake until fragrant and slightly darkened in color, about 15 minutes. Cool pecans on baking sheet."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/57a37581bd7fde737c837884\/6:4\/w_620%2Ch_413\/sea-salt-roasted-pecans.jpg","protein":12.0,"fat":270.0,"ingredients":["2 cups pecan halves","3 tablespoons unsalted butter, melted","1 1\/4 teaspoons fine sea salt"],"calories":279.0,"id":25,"title":"Sea Salt-Roasted Pecans ","labels":["HIGHFATMODERATEPROTEIN"]},{"sodium":250.0,"directions":["Gently combine the eggs, cucumbers, shallots, green onions, and basil in a medium bowl. Stir in the mayonnaise, salt, and pepper.","Store in the refrigerator for up to three days."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/54b2f12811c5d6af478b455f\/6:4\/w_620%2Ch_413\/364869_egg-salad_1x1.jpg","protein":24.0,"fat":180.0,"ingredients":["6 hard-cooked eggs, diced (2 cups)","3\/4 cup seeded, diced cucumbers (about 1\/2 cucumber)","1\/4 cup minced shallots","1\/2 cup sliced green onions (green part only)","3 tablespoons lightly packed chopped fresh basil","1\/2 cup mayonnaise","1\/4 teaspoon kosher salt","1\/4 teaspoon freshly ground pepper"],"calories":215.0,"id":27,"title":"Cucumber-Basil Egg Salad ","labels":["LOWCALORIE","HIGHFATMODERATEPROTEIN"]},{"sodium":765.0,"directions":["In a food processor grind the ham until it is minced, add the mustard, the butter, the honey, and the cloves, and blend the mixture until it is smooth. Transfer the mixture into a bowl and stir in the onion, the pickle, and pepper to taste. Serve the deviled ham with crackers or as a sandwich filling."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/57191b0f94956b31172ec1c9\/6:4\/w_620%2Ch_413\/Deviled-Green-Eggs.jpg","protein":40.0,"fat":117.0,"ingredients":["3\/4 pound cooked ham, cut into pieces","1\/4 cup Dijon-style mustard","1\/2 stick (1\/4 cup) unsalted butter, softened","1 tablespoon honey","1\/4 teaspoon ground cloves","3 tablespoons minced onion","3 tablespoons minced sweet pickle"],"calories":185.0,"id":34,"title":"Deviled Ham ","labels":["LOWCALORIE","HIGHPROTEIN"]},{"sodium":1248.0,"directions":["Melt 2 tablespoons butter with vegetable oil in heavy large skillet over medium-high heat. Add all onions; cook until deep brown, stirring often, about 8 minutes. Add sugar and sauté until sugar dissolves, about 1 minute. Add 1\/2 cup vinegar; sauté until almost all liquid evaporates, about 1 minute. Transfer to small bowl.","Preheat oven to 200°F. Mix salt, 1\/2 teaspoon cumin, and pepper in small bowl. Rub chicken breasts all over with spice mixture. Heat 2 teaspoons olive oil in heavy large skillet over medium-high heat; add chicken breasts, skin side down. Sauté until cooked through, about 4 minutes per side. Transfer chicken to baking sheet. Keep warm in oven.","Heat remaining 2 teaspoons olive oil in same skillet over medium heat. Add garlic and sauté 20 seconds. Add caramelized onions, 1\/4 cup vinegar, tomato, olives, capers, and Sherry. Cook until liquid reduces slightly, stirring constantly, about 2 minutes. Stir in 1 1\/2 teaspoons cumin, chicken broth, lime juice, sage, thyme, and rosemary. Add avocado; cook until sauce thickens, stirring constantly, about 3 minutes. Reduce heat to low. Add 4 tablespoons butter and stir until blended into sauce. Season with salt and pepper. Place 1 chicken breast on each of 6 plates; spoon sauce over."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/560df907f3a00aeb2f1d64ad\/6:4\/w_620%2Ch_413\/108576.jpg","protein":156.0,"fat":396.0,"ingredients":["6 tablespoons (3\/4 stick) chilled butter","3 tablespoons vegetable oil","1 large red onion, halved lengthwise, thinly sliced crosswise","1\/2 yellow onion, thinly sliced","1 1\/2 tablespoons sugar","3\/4 cup Sherry wine vinegar","1 tablespoon coarse kosher salt","2 teaspoons ground cumin","1\/4 teaspoon ground black pepper","6 boneless chicken breast halves with skin","4 teaspoons olive oil","4 garlic cloves, thinly sliced","1 large tomato, peeled, seeded, diced","1\/4 cup coarsely chopped pitted oil-cured black olives","1\/4 cup drained capers, rinsed","1\/4 cup Sherry","1\/3 cup low-salt chicken broth","1\/4 cup fresh lime juice","1 tablespoon chopped fresh sage","1 tablespoon chopped fresh thyme","1 teaspoon minced fresh rosemary","1 ripe avocado, halved, pitted, peeled, cut into 1\/2-inch cubes"],"calories":625.0,"id":36,"title":"Aztec Chicken ","labels":["HIGHPROTEIN"]},{"sodium":329.0,"directions":["Cut off and discard 1 inch from stem ends of broccoli rabe. Cook broccoli rabe, uncovered, in 2 batches in a 6- to 8-quart pot of boiling salted water until just tender, about 3 minutes, transferring with a slotted spoon to a large bowl of ice and cold water to stop cooking. Drain well in a colander.","Cook garlic in oil in a 12-inch nonstick skillet over moderate heat, stirring occasionally, until garlic is golden, about 5 minutes. Add broccoli rabe and cook, tossing to coat with oil, until heated through, 3 to 5 minutes. Toss broccoli rabe with salt."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/560d79567b55306961bf35fd\/6:4\/w_620%2Ch_413\/350629_hires.jpg","protein":16.0,"fat":90.0,"ingredients":["2 lb broccoli rabe","3 large garlic cloves, thinly sliced lengthwise","1\/3 cup extra-virgin olive oil","1 teaspoon salt (preferably sea salt), or to taste","Accompaniment: lemon wedges"],"calories":107.0,"id":38,"title":"Sauteed Broccoli Rabe ","labels":["LOWCALORIE","HIGHFATMODERATEPROTEIN"]},{"sodium":413.0,"directions":["Working off heat, put 1 tablespoon oil in a 10-inch nonstick skillet and add fish, turning to coat with oil on both sides. Arrange fish skinned sides down and sprinkle with salt and pepper.","Toss together tomato, garlic (if using), basil, remaining tablespoon oil, and salt and pepper to taste in a small bowl, then mound on top of fish. Cover skillet with a tight-fitting lid and cook fish over moderately high heat until just cooked through, about 8 minutes."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/560ea0f77b55306961bfefa2\/6:4\/w_620%2Ch_413\/106744.jpg","protein":176.0,"fat":144.0,"ingredients":["2 tablespoons extra-virgin olive oil","1 (1-lb) piece grouper or red snapper fillet (3\/4 inch thick), skinned and halved crosswise","1\/4 teaspoon salt","1\/8 teaspoon black pepper","1\/2 cup coarsely chopped tomato","1 small garlic clove, minced (optional)","2 tablespoons thinly sliced fresh basil","Accompaniment: fresh corn spoon bread"],"calories":336.0,"id":39,"title":"Grouper with Tomato and Basil ","labels":["HIGHPROTEIN"]},{"sodium":208.0,"directions":["Whisk together flour (2 cups), sugar, salt, and yeast in a bowl until combined. Whisk together water, oil, and egg in another bowl until combined well, then stir into flour mixture until a shaggy dough forms. Turn out dough onto a lightly floured surface and knead, working in just enough additional flour to keep dough from sticking, about 2 minutes (dough will not be smooth). Form dough into a ball and put in an oiled bowl, turning to coat, then let rest in bowl, uncovered, in a warm draft-free place 10 minutes.","Cut dough into 10 pieces and form each into a ball. Working with 1 piece at a time, flatten balls, then roll out into 6-inch rounds (less than 1\/8 inch thick) on lightly floured surface with a lightly floured rolling pin.","Preheat grill pan or skillet over moderately high heat just until smoking, then reduce heat to moderate and grill bread rounds, 1 at a time, turning once, until marks appear and bread is cooked through, about 2 minutes. Keep breads warm, wrapped in a cloth napkin."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/560dd6e0f9a84192308a4c23\/6:4\/w_620%2Ch_413\/233267.jpg","protein":12.0,"fat":54.0,"ingredients":["2 cups all-purpose flour plus additional for dusting","1 teaspoon sugar","1 teaspoon salt","1\/2 teaspoon fast-acting yeast from 1 (1\/4-oz) package such as Fleischmann's Rapid Rise yeast","1\/4 cup plus 1 tablespoon warm water (105-115°F)","1\/4 cup canola or vegetable oil","1 tablespoon beaten egg","Special equipment: a lightly oiled ridged grill pan, cast-iron skillet, or griddle"],"calories":145.0,"id":40,"title":"Better-Than-Pita Grill Bread ","labels":["LOWCALORIE"]},{"sodium":100.0,"directions":["Position rack in middle of oven; preheat to 350°F. Spread coconut in a single layer on a rimmed baking sheet and toast until golden brown and aromatic, 3–5 minutes. Let cool 5 minutes.","Meanwhile, coat a 13x9\" pan with nonstick spray. Dust with flour, tapping out any excess.","Whisk toasted coconut, baking powder, salt, and 1 3\/4 cups flour in a medium bowl. Mix coconut oil, vanilla, and 2\/3 cup coconut milk in another medium bowl.","Cream sugar and butter in the bowl of a stand mixer fitted with the paddle attachment at medium speed, occasionally scraping down sides of bowl, until pale and fluffy, 3–4 minutes. Add eggs, one at a time, beating to blend after each addition. Reduce mixer speed to low and beat in dry ingredients in 3 additions, alternating with coconut milk mixture in 2 additions, beginning and ending with dry ingredients. Pour batter into prepared pan, smoothing top with a spatula.","Bake cake until top is set and golden brown and a tester inserted into the center comes out clean, 25–30 minutes.","Mix key lime zest, juice, and remaining 2\/3 cup coconut milk in a small bowl (it's okay if mixture separates slightly; it will be absorbed by cake). Using a skewer, poke holes every 2\" into warm cake. Slowly pour key lime zest mixture over cake. Transfer pan to a wire rack and let cake cool completely.","Pour water into a medium pot to a depth of 2\". Bring to a simmer over medium heat. Place butter in a large bowl.","Whisk egg yolks and sugar in a heatproof medium bowl. Whisk in key lime zest and juice. Set bowl on saucepan, making sure bottom does not touch water. Cook, whisking occasionally, until mixture is thick enough to coat the back of a spoon and an instant-read thermometer registers 175°F, 3–4 minutes.","Strain egg yolk mixture through a fine-mesh sieve over butter, then stir with a rubber spatula until smooth. Place a piece of plastic wrap directly on key lime curd and chill at least 30 minutes.","Using an electric mixer on medium speed, beat cream in a large bowl until stiff peaks form. Gently fold in chilled key lime curd and key lime zest. Spread cream on cooled cake with a spatula, then chill 30 minutes to set cream.","Meanwhile, preheat oven to 350°F. Spread coconut flakes in a single layer on rimmed baking sheet and toast, tossing halfway through, until crispy and golden, 5–7 minutes. Let cool.","When ready to serve, sprinkle toasted coconut flakes over cake.","Lime curd can be made 1 week ahead. Store in an airtight container and chill, or freeze up to 4 months."],"imageURL":"","protein":20.0,"fat":315.0,"ingredients":["1 1\/2 cups unsweetened shredded coconut","Nonstick vegetable oil spray","1 3\/4 cups cake flour, plus more for pan","1\/2 teaspoon baking powder","1\/2 teaspoon kosher salt","1\/3 cup virgin coconut oil, melted","1 1\/2 teaspoons vanilla extract","1 1\/3 cups canned unsweetened coconut milk, divided","1 1\/2 cups sugar","3\/4 cup (1 1\/2 sticks) unsalted butter, room temperature","3 large eggs","1 tablespoon finely grated key lime zest","1\/3 cup fresh key lime juice (from about 6 key limes)","1\/4 cup (1\/2 stick) unsalted butter, cut into pieces, room temperature","3 large egg yolks","1\/2 cup sugar","1 teaspoon finely grated key lime zest","1\/4 cup fresh key lime juice (from about 4 key limes)","1 1\/2 cups cold heavy cream","1 teaspoon finely grated key lime zest","1 cup unsweetened coconut flakes"],"calories":483.0,"id":41,"title":"Coconut-Key Lime Sheet Cake ","labels":["LOWSODIUM","HIGHFATMODERATEPROTEIN"]},{"sodium":181.0,"directions":["Preheat oven to 425°F. Whisk 2 tablespoons oil and lemon juice in bowl; season dressing with salt and pepper. Place halibut on rimmed baking sheet; sprinkle with salt and pepper. Drizzle with some of dressing. Bake until just opaque in center, about 12 minutes.","Meanwhile, cook pasta in large saucepan of boiling salted water until tender but still firm to bite; drain. Add 2 tablespoons oil and garlic to same saucepan; sauté over medium heat 1 minute. Add drained pasta, spinach, and tomatoes; stir to coat. Season with salt and pepper. Remove from heat. Cover; let stand 1 minute (spinach will wilt). Divide pasta between 2 plates. Top with halibut and remaining dressing."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/560de5d4f3a00aeb2f1d5534\/6:4\/w_620%2Ch_413\/232872.jpg","protein":176.0,"fat":279.0,"ingredients":["4 tablespoons extra-virgin olive oil, divided","2 tablespoons fresh lemon juice","2 6- to 7-ounce halibut fillets","1 cup orzo (rice-shaped pasta)","1 garlic clove, minced","4 cups (packed) baby spinach","1 cup halved cherry tomatoes"],"calories":634.0,"id":42,"title":"Baked Halibut with Orzo, Spinach, and Cherry Tomatoes ","labels":["LOWSODIUM","HIGHPROTEIN"]},{"sodium":881.0,"directions":["Toss first 3 ingredients in large glass bowl. Add juice and vinegar; press down to submerge onions. Cut 1\/2-inch-long slit in narrow tip of chile and add to onion mixture. Top mixture with small plate to weigh down slightly. Cover; refrigerate overnight. Drain. DO AHEAD Can be made 1 week ahead. Keep refrigerated."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/5e95fb10febe90000898aff8\/6:4\/w_620%2Ch_413\/PlantainBreakfast_HERO_041020_6266.jpg","protein":8.0,"fat":0.0,"ingredients":["1 1\/2 pounds red onions, peeled, halved, cut into 1\/8-inch-thick slices","1 1\/2 teaspoons salt","1\/2 teaspoon dried oregano","1 cup fresh lime juice","1\/2 cup distilled white vinegar","1 small habanero chile*","*Extremely hot chile; available in some supermarkets and at Latin markets."],"calories":90.0,"id":46,"title":"Pickled Red Onions ","labels":["LOWFAT","LOWCALORIE"]},{"sodium":815.0,"directions":["In a kettle combine the beans, the ham hock, the garlic, the bay leaf, the orégano, the onion, the bell peppers, the red pepper flakes, the chili powder, and 8 cups water and simmer the mixture, covered, stirring occasionally, for 3 hours, or until the beans are tender. Stir in the tomatoes and salt to taste and simmer the mixture, uncovered, stirring occasionally, for 1 hour, or until the mixture is thickened. Discard the bay leaf, remove the ham hock from the mixture, and chop the meat. Stir the meat into the mixture with the coriander and the vinegar and serve the beans over the rice with the radish or onion.","In a colander rinse the beans under cold water and discard any discolored ones. In a kettle combine the beans with enough cold water to cover them by 2 inches, bring the water to a boil, and boil the beans for 2 minutes. Remove the kettle from the heat and let the beans soak, covered, for 1 hour."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/5ecfd227bf7262278bb3fba8\/6:4\/w_620%2Ch_413\/KoreanBlackBeans-RECIPE-052720_7755.jpg","protein":76.0,"fat":72.0,"ingredients":["1 pound dried black beans, soaked in enough cold water to cover them by 2 inches overnight or quick-soaked (procedure follows) and drained","1 ham hock","2 large garlic cloves, minced","1 bay leaf","1 1\/2 teaspoons dried orégano, crumbled","3 cups coarsely chopped onion","2 green bell peppers, chopped","1\/2 teaspoon dried hot red pepper flakes, or to taste","1 tablespoon chili powder","a 28-ounce can Italian tomatoes, drained and chopped","1\/3 cup finely chopped fresh coriander, or to taste","red-wine vinegar to taste","cooked rice as an accompaniment","chopped radish or red onion as an accompaniment"],"calories":202.0,"id":47,"title":"Spicy Black Beans and Rice ","labels":["LOWCALORIE","HIGHPROTEIN"]},{"sodium":174.0,"directions":["Heat oil in heavy large pot over medium heat. Add garlic and stir 20 seconds. Add chicken and oregano to pot; sprinkle with salt and pepper. Sauté 3 minutes. Add broth and lime juice and bring to simmer. Reduce heat to medium-low and simmer gently until chicken is cooked through, about 8 minutes. Season soup to taste with salt and pepper.","Divide crushed tortilla chips among 6 bowls. Ladle soup into bowls. Top soup with avocados, tomatoes, green onions, cilantro and jalapeños. Garnish with lime slices and serve."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/5bc4da2cc031cd2d7e932cd7\/6:4\/w_620%2Ch_413\/silky-pork-and-cumin-stew-bowl-recipe-BA-101518.jpg","protein":56.0,"fat":189.0,"ingredients":["2 tablespoons olive oil","6 garlic cloves, sliced","6 small skinless boneless chicken breast halves, cut crosswise into 1\/2-inch-wide strips","1 1\/2 teaspoons dried oregano","9 cups canned low-salt chicken broth","1\/3 cup fresh lime juice","1 1\/2 cups coarsely crushed tortilla chips","2 avocados, peeled, pitted, diced","3 tomatoes, chopped","3 green onions, sliced","Chopped fresh cilantro","Minced jalapeño chilies","Lime slices"],"calories":338.0,"id":49,"title":"Mexican Lime Soup ","labels":["LOWSODIUM","HIGHPROTEIN"]},{"sodium":4.0,"directions":["Cut peel and white pith from grapefruits and oranges. Cut between membranes to release segments. Combine fruit in large shallow bowl. (Fruit can be segmented 1 day ahead. Cover and refrigerate.)","Place mint and sugar in processor. Using on\/off turns, blend until mint is finely chopped, occasionally scraping down sides of bowl. Sprinkle mint sugar and pomegranate seeds over fruit; serve."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/56043ab1968c2fa94dc98b1d\/6:4\/w_620%2Ch_413\/368291_hires.jpg","protein":12.0,"fat":9.0,"ingredients":["2 white grapefruits","2 pink grapefruits","6 large navel oranges","1\/2 cup fresh mint leaves","1\/4 cup sugar","Seeds from 1 pomegranate or 1\/4 cup dried cranberries"],"calories":191.0,"id":50,"title":"Citrus Salad with Mint Sugar ","labels":["LOWSODIUM","LOWFAT","LOWCALORIE"]},{"sodium":211.0,"directions":["Preheat oven to 400°F with rack in middle. Butter muffin pan if not nonstick.","Soak raisins in hot water 5 minutes, then drain.","Meanwhile, whisk together flour, baking powder, baking soda, spices, and salt in a large bowl.","In a separate bowl, whisk together butter, brown sugar, pumpkin, buttermilk, eggs, and vanilla. Add to dry ingredients and stir until just combined, then stir in raisins and 2 tablespoons pumpkin seeds.","Divide batter among muffin cups and sprinkle with remaining seeds. Bake until a wooden pick comes out clean, about 20 minutes. Cool slightly on a rack."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/59ca5e3d8ecca72fb3121947\/16:9\/w_2560%2Cc_limit\/Why-You-Should-Be-Eating-Sweet-Potatoes-For-Breakfast-HERO-20092017.jpg","protein":16.0,"fat":90.0,"ingredients":["1\/3 cup golden raisins","2 cups all-purpose flour","2 teaspoon baking powder","1\/4 teaspoon baking soda","1 teaspoon ground cinnamon","3\/4 teaspoon ground ginger","1\/8 teaspoon ground allspice","1\/8 teaspoon ground cloves","1\/2 teaspoon salt","1 stick unsalted butter, melted and cooled","3\/4 cup packed light brown sugar","3\/4 cup canned pure pumpkin","1\/4 cup well-shaken buttermilk","2 large eggs","1 teaspoon pure vanilla extract","3 tablespoon raw green (hulled) pumpkin seeds (pepitas), divided","Equipment: a muffin pan (preferably nonstick) with 12 (1\/2-cup) muffin cups"],"calories":223.0,"id":58,"title":"Pumpkin Muffins ","labels":["LOWCALORIE"]},{"sodium":697.0,"directions":["Heat butter in a 3-quart heavy saucepan over moderate heat until foam subsides, then cook shallot, stirring, until golden brown, about 5 minutes. Stir in remaining ingredients and simmer briskly, uncovered, stirring occasionally, until thickened and reduced to about 2 1\/4 cups, about 25 minutes."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/560d99d5f9a84192308a1b08\/6:4\/w_620%2Ch_413\/238823.jpg","protein":8.0,"fat":27.0,"ingredients":["1 1\/2 tablespoons unsalted butter","1 cup finely chopped shallot","1 cup thawed frozen orange juice concentrate (8 oz)","1\/2 cup water","1\/2 cup sweet orange preserves","1\/2 cup balsamic vinegar","1 tablespoon salt","1\/2 tablespoon cracked black peppercorns","1 1\/2 teaspoons finely grated fresh orange zest"],"calories":194.0,"id":59,"title":"Orange Balsamic Glaze ","labels":["LOWFAT","LOWCALORIE"]},{"sodium":112.0,"directions":["Prepare grill for direct-heat cooking over hot charcoal (high heat for gas); see Grilling Procedure .","Put parmesan in a medium bowl and add olive oil in a slow stream, whisking. Whisk in lime juice, garlic, chipotles, and 1\/4 teaspoon each of salt and pepper.","Rub vegetable oil on corn and cut sides of avocados, then season with 1\/8 teaspoon each of salt and pepper. Grill avocados, cut sides down, and corn, covered only if using a gas grill, turning corn occasionally, until golden-brown, 3 to 4 minutes.","Peel avocados and thinly slice. Cut corn kernels from cobs.","Toss romaine with dressing and serve topped with avocado and corn."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/54bd20be2a4b69f8647eb629\/6:4\/w_620%2Ch_413\/romaine-avocado-corn-chipotle-caesar-6x4.jpg","protein":24.0,"fat":288.0,"ingredients":["1\/4 cup grated parmesan","1\/2 cup extra-virgin olive oil","1\/4 cup fresh lime juice","1 teaspoon minced garlic","1 tablespoon minced canned chipotle chiles in adobo","3 tablespoons vegetable oil","2 ears of corn, shucked","2 firm-ripe 6-to 8-ounces avocados, halved and pitted but not peeled","1 head romaine (1 pound), tough outer leaves discarded and head quartered lengthwise, then cut crosswise into 1-inch strips"],"calories":368.0,"id":62,"title":"Romaine, Grilled Avocado, and Smoky Corn Salad with Chipotle-Caesar Dressing ","labels":["LOWSODIUM","HIGHFATMODERATEPROTEIN"]},{"sodium":89.0,"directions":["Preheat oven to 250°F and line 2 large baking sheets with parchment.","Swirl whites in a metal bowl set over a saucepan of simmering water until barely warm to the touch. Beat whites with salt in a standing electric mixer until they hold soft peaks. Beat in 2 cups superfine sugar and continue beating until mixture holds stiff, glossy peaks (see cooks' note, below). Stir together remaining 1\/2 cup superfine sugar and cornstarch. Beat into meringue, then beat in vinegar.","Spoon 8 mounds of meringue (each about 2 inches high and approximately 1\/2 cup) 1 inch apart on each lined baking sheet. Divide any remaining meringue among mounds. Bake in upper and lower thirds of oven, switching position of sheets halfway through baking, until crisp but still soft inside, 1 to 1 1\/4 hours total. If meringues are still not crisp after 1 1\/4 hours, turn off oven and cool in oven 1 hour. Transfer from parchment to racks to cool. (Meringues may stick if cooled completely on paper.)","Just before serving, toss strawberries with lime juice and 1\/4 cup granulated sugar and let stand, tossing occasionally until sugar is dissolved, 10 minutes. Add blackberries and toss to coat.","Beat cream with vanilla and remaining 1 1\/2 tablespoons granulated sugar with cleaned beaters. Tap meringues gently with back of a spoon to create indentations, then mound some whipped cream and berries onto each."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/561025eff9a84192308aa376\/6:4\/w_620%2Ch_413\/103405.jpg","protein":16.0,"fat":63.0,"ingredients":["13 large egg whites","1\/4 teaspoon salt","2 1\/2 cups superfine granulated sugar","1 1\/2 tablespoons cornstarch","1 1\/2 tablespoons distilled white vinegar","2 lb strawberries, halved or quartered if large","3 tablespoons fresh lime juice","1\/4 cup plus 1 1\/2 tablespoons granulated sugar","1 lb blackberries","2 1\/2 cups chilled heavy cream","2 teaspoons vanilla","Special equipment: a standing electric mixer"],"calories":252.0,"id":65,"title":"Mixed Berry Pavlovas ","labels":["LOWSODIUM","LOWFAT"]},{"sodium":340.0,"directions":["Grind the parsley, sage, rosemary, and thyme into a fine powder. I use a coffee grinder for this.","In a mixing bowl, crumble the tofu and mix well with the spice mixture so that the herbs are well infused with the tofu. Let sit for the flavors to meld.","In a microwave-safe bowl, mix together the TVP granules and the broth, cover tightly with plastic wrap, and microwave for 5 to 6 minutes. Alternatively, bring the broth to a boil, pour over the TVP, cover, and let sit for 10 minutes.","When cool enough to handle, add the TVP to the tofu mixture, then add the minced garlic, flaxseed mixture, sunflower seeds, pumpkin seeds, and salt and pepper to taste. Mix with your hands until all the ingredients are very well incorporated. The mixture will be nice and smooth, and should form lovely burgers. Shape into 6 patties. Refrigerate until ready to cook, although refrigeration isn't necessary if you plan on cooking them right away.","I recommend baking these rather than frying. It just seems that this burger is too healthy to fry. Preheat the oven to 350°F (180°C, or gas mark 4) and line a baking sheet with parchment or a silicone baking mat. Bake, covered with a foil tent, for 15 minutes per side."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/54b2af8211c5d6af478b2594\/6:4\/w_620%2Ch_413\/366471_tofu-burger_1x1.jpg","protein":84.0,"fat":108.0,"ingredients":["1 tablespoon (2 g) dried parsley","1 tablespoon (2 g) dried sage","1 tablespoon (2 g) dried rosemary","1 tablespoon (2 g) dried thyme","12 ounces (340 g) extra-firm tofu, drained and pressed","1 cup (96 g) TVP granules","1 cup (235 ml) vegetable broth","2 tablespoons (30 g) minced garlic","2 1\/2 tablespoons (19 g) ground flaxseed mixed with","3 tablespoons (45 ml) water","1\/4 cup (32 g) hulled sunflower seeds","1\/4 cup (32 g) hulled pumpkin seeds","Salt and pepper"],"calories":224.0,"id":67,"title":"Scarborough Fair Tofu Burger ","labels":["LOWCALORIE","HIGHPROTEIN"]},{"sodium":155.0,"directions":["Combine the vinegar, garlic, mustard, and oregano in a small bowl. Add the olive oil in a slow, steady stream while whisking constantly until all the oil is incorporated. Season with salt and pepper and refrigerate in an airtight container until ready to use or up to 1 week."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/5d49f1e2844ed80008f5b0c1\/6:4\/w_620%2Ch_413\/RomanoBeans_RECIPE_073119_124.jpg","protein":0.0,"fat":180.0,"ingredients":["1\/4 cup red wine vinegar","3 garlic cloves, minced","1 teaspoon Dijon mustard","2 tablespoons chopped fresh oregano or 2 teaspoons dried oregano","3\/4 cup extra-virgin olive oil","Salt and freshly ground black pepper to taste","N\/A freshly ground black pepper"],"calories":185.0,"id":68,"title":"Italian Vinaigrette ","labels":["LOWSODIUM","LOWCALORIE","HIGHFATMODERATEPROTEIN"]},{"sodium":148.0,"directions":["Blend first 4 ingredients in processor until nuts are finely ground. Add butter; cut in using on\/off turns until mixture resembles coarse meal. Add 2 tablespoons ice water and vanilla; process until moist clumps form, adding more ice water by teaspoonfuls if dough is dry. Gather dough into ball. Divide into 6 equal pieces. Flatten each into disk. Wrap each in plastic; chill 2 hours. (Can be made 2 days ahead. Keep chilled. Let dough soften slightly before continuing.)","Preheat oven to 375°F. Press 1 dough disk evenly onto bottom and up sides of 4 1\/2-inch-diameter tartlet pan with removable bottom. Pierce crust all over with fork. Repeat with remaining 5 dough disks. Freeze crusts until firm, about 20 minutes.","Bake crusts until golden and baked through, about 25 minutes. Remove from oven. Immediately sprinkle bittersweet chocolate over bottom of hot crusts, dividing equally. Let stand until chocolate melts, about 5 minutes. Using back of spoon, spread chocolate over bottom of crusts. Chill until chocolate sets, about 10 minutes.","Stir white chocolate in top of double boiler set over barely simmering water until just melted and smooth. Remove top of double boiler from over water. Cool white chocolate to room temperature. Beat cream and liqueur in medium bowl until soft peaks form. Fold cream mixture into melted white chocolate in 3 additions. Divide filling among tartlet crusts; smooth tops. Chill until filling is set, about 4 hours. (Can be made 1 day ahead. Cover loosely with foil; keep chilled.)","Gently toss banana slices and orange juice in bowl. Transfer banana slices to paper towels; pat dry. Alternate banana slices and strawberry slices in circle atop tartlets, overlapping. (Can be prepared 2 hours ahead. Chill.)"],"imageURL":"https:\/\/assets.epicurious.com\/photos\/561025ddf3a00aeb2f1d7a3e\/6:4\/w_620%2Ch_413\/103302.jpg","protein":36.0,"fat":531.0,"ingredients":["1 1\/4 cups all purpose flour","1\/2 cup hazelnuts, toasted, husked","1\/4 cup sugar","1\/4 teaspoon salt","1\/2 cup (1 stick) chilled unsalted butter, cut into 1\/2-inch pieces","2 tablespoons (or more) ice water","1 teaspoon vanilla extract","2 ounces bittersweet (not unsweetened) or semisweet chocolate, finely chopped","6 ounces good-quality white chocolate (such as Lindt or Baker’s), finely chopped","3\/4 cup chilled whipping cream","2 tablespoons Grand Marnier or other orange liqueur","2 medium bananas, peeled, thinly sliced","1\/4 cup orange juice","1 1-pint basket strawberries"],"calories":830.0,"id":69,"title":"White Chocolate Tartlets with Strawberries and Bananas ","labels":["LOWSODIUM","HIGHFATMODERATEPROTEIN"]},{"sodium":84.0,"directions":["1. Preheat the oven to 350°F. Spread the nuts on a baking sheet and roast for 10 to 15 minutes, or just until they begin to brown. Remove the baking sheet from the oven and allow the nuts to cool slightly.","2. Place the nuts, salt, and honey in the bowl of the food processor fit with the chopping blade. Blend for 20 seconds. With the motor still running, drizzle 3 tablespoons of oil into the bowl through the chute in the lid, and process for 30 seconds. If the nut butter is still dry, continue to blend and add the additional tablespoon of oil. Process for up to another minute to reach your desired consistency. Taste and adjust for salt, if needed."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/5f57e012ed1941607d725ccd\/6:4\/w_620%2Ch_413\/nut-butter-granola-bars-recipe-BA-090820.jpg","protein":28.0,"fat":216.0,"ingredients":["1 pound (3 1\/2 cups) shelled raw nuts","1\/2 teaspoon kosher salt, plus more to taste","2 teaspoons honey","3 to 4 tablespoons canola or peanut oil"],"calories":264.0,"id":74,"title":"Nut Butter ","labels":["LOWSODIUM","HIGHFATMODERATEPROTEIN"]},{"sodium":599.0,"directions":["Combine the ingredients in a food processor. Process until the dough mixture leaves the sides of the bowl. Remove to a mixing bowl and knead by hand for a few minutes until smooth. (If the dough is too dry, add a few drops of water.) Divide into 4 equal parts and shape them into discs. Wrap in plastic wrap and let rest for 1 hour.","Put the cheeses, salt, and pepper in a blender and pulse. Add the egg yolks and pulse until incorporated.","Roll the discs of dough into thin sheets in a pasta machine. Arrange tablespoon-size dollops of the filling 1 1\/2 inches apart on one of the sheets. Brush a little egg white around each dollop, then place another sheet directly on top. Gently press around the filling to remove any air pockets and seal the sheets. Using a ravioli cutter or a knife, cut out ravioli squares. Sprinkle with flour to prevent the dough from sticking.","Cook the ravioli in plenty of boiling salted water until they float to the top, 3 to 4 minutes. Drain well and toss with the Fresh tomato sauce . Garnish with the remaining chopped basil and serve immediately."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/560dd81bf3a00aeb2f1d29d2\/6:4\/w_620%2Ch_413\/236983.jpg","protein":76.0,"fat":126.0,"ingredients":["3 large eggs","6 egg yolks","3 cups flour","A pinch of salt","1 (16-ounce) container ricotta","1 cup grated Parmesan","Salt and black pepper to taste","2 egg yolks (set the whites aside)","Fresh tomato sauce"],"calories":365.0,"id":75,"title":"Cheese Ravioli with Fresh Tomato Sauce ","labels":["HIGHPROTEIN"]},{"sodium":51.0,"directions":["Preheat oven to 325°F.","Whisk together cream, milk, syrup, and pumpkin in a heavy saucepan and bring just to a simmer over moderate heat.","Whisk together yolks, cinnamon, nutmeg, and salt in a bowl.","Add hot pumpkin mixture to yolks in a slow stream, whisking constantly. Pour custard through a fine-mesh sieve into a large measuring cup, then divide among custard cups (you may have some custard left over, depending on size of cups). Bake custards in a hot water bath, pan covered tightly with foil, in middle of oven until a knife inserted in center of a custard comes out clean, 35 to 40 minutes. Transfer custards to a rack to cool completely. Chill, covered, until cold, at least 2 hours.","Available at some cookware stores and Sur La Table (800-243-0852)."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/59f0cacf56d228194784bc8f\/6:4\/w_620%2Ch_413\/pumpkin-pots-de-creme-gourmet-recipe-102517.jpg","protein":12.0,"fat":72.0,"ingredients":["1 cup heavy cream","3\/4 cup whole milk","3\/4 cup pure maple syrup","1\/2 cup canned solid-pack pumpkin","7 large egg yolks","1\/2 teaspoon cinnamon","1\/8 teaspoon freshly grated nutmeg","1\/8 teaspoon salt","Special equipment: 10 (2- to 3-oz) custard cups* or ramekins"],"calories":157.0,"id":79,"title":"Maple Pumpkin Pots de Crème ","labels":["LOWSODIUM","LOWCALORIE"]},{"sodium":220.0,"directions":["Rinse the rice in a sieve under cold running water until the water runs clear; put to one side.","Heat the olive oil in a large, heavy-bottomed pot and throw in the onions. Cook over medium heat until they soften and turn golden. Season the chicken thighs and add them to the pan. Brown on all sides, then pour in 2 1\/2 cups water and bring to a simmer. Cover with a lid and cook until the chicken is tender, about 20 minutes.","Meanwhile, peel the zest from the orange with a potato peeler, then cut it into matchstick strips. Blanch in a small pan of boiling water for a couple of minutes, then drain.","Dissolve the sugar in 1\/2 cup (scant) water in a small, heavy-bottomed pan over medium heat, then bring to a boil and let bubble to reduce and thicken for 5 to 10 minutes until syrupy. Add the orange zest, slivered almonds, and pistachios and boil for 5 minutes, skimming off any froth. Strain the syrup and return to the pan; set aside the orange zest and nuts. Add the saffron and rose water to the syrup and boil again for 3 minutes, then add the cardamom seeds.","Preheat the oven to 300 degrees F. Strain the stock from the chicken thighs and add the syrup to it. Make this up to 3 cups with more water. Bring it to a boil in an ovenproof casserole and add the rice. Season and add two-thirds of the orange zest and nuts, keeping the rest to one side. Bring back to a boil, then cover and simmer until the rice is cooked. The liquid should have all been absorbed by now.","Bury the chicken and onions in the rice and add the fava beans and peas, if you are including them. Put the lid on and cook in the oven for 20 minutes.","Serve straight from the pan or, if you prefer, in a large, warmed serving dish. Sprinkle the last third of the orange zest and nuts over the top before bringing it to the table."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/54b3168a460b4423363ea493\/6:4\/w_620%2Ch_413\/358563_braised-chicken_1x1.jpg","protein":216.0,"fat":657.0,"ingredients":["1 1\/2 cups brown basmati rice","1\/4 cup olive oil","2 medium onions, peeled and minced","coarse salt and black pepper","4 large chicken thighs, chopped in half, or 8 smaller ones","about 4 cups water","1 large organic orange","1 tablespoon unrefined granulated sugar","1\/2 cup slivered blanched almonds","1\/2 cup shelled, chopped pistachio nuts","large pinch of saffron threads","2 to 3 teaspoons rose water","7 or 8 cardamom pods, lightly crushed, seeds extracted","a handful of blanched, skinned baby fava beans (optional)","a handful of blanched peas (optional)"],"calories":1172.0,"id":81,"title":"Braised Chicken and Rice with Orange, Saffron, Almond, and Pistachio Syrup ","labels":["HIGHPROTEIN"]},{"sodium":909.0,"directions":["Bring all ingredients to boil in large pot. Reduce heat; simmer uncovered until chicken is cooked through, about 30 minutes. Transfer chicken to bowl; cover to keep warm. Reserve chicken broth in pot; spoon off fat from surface.","Heat heavy large skillet over medium-low heat. Add pepitas; stir frequently until seeds puff and begin to pop, about 15 minutes (do not brown). Transfer to dish; cool. Set aside 2 tablespoons pepitas for garnish. Working in batches, finely grind remaining pepitas with peppercorns in spice mill or coffee grinder.","Puree tomatillos, next 5 ingredients, and 1\/2 cup reserved chicken broth in blender until almost smooth. Heat 2 tablespoons oil in heavy medium skillet over medium-high heat. Add tomatillo mixture and simmer until sauce is thick and reduced to 1 cup, stirring frequently, about 5 minutes.","Heat remaining 4 tablespoons oil in heavy large pot over medium heat. Add ground pepita mixture. Stir constantly until mixture resembles very coarse paste and begins to color in spots, about 9 minutes. Add tomatillo mixture; stir 1 minute. Add 2 cups reserved chicken broth and bring to boil. Reduce heat to medium-low and simmer until sauce is thick, stirring constantly, about 3 minutes longer. Season sauce to taste with salt. Spoon some sauce onto platter. Top with chicken. Spoon remaining sauce over. Garnish with reserved 2 tablespoons pepitas."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/54b2e2013edeef84363b2983\/6:4\/w_620%2Ch_413\/365369_pumpkin-seed-mole_1x1.jpg","protein":144.0,"fat":513.0,"ingredients":["5 cups water","6 chicken thighs with skin and bones","1\/4 large white onion","3 garlic cloves, halved","3 large fresh cilantro sprigs","1 teaspoon fine sea salt","1 2\/3 cups shelled pepitas (pumpkin seeds)","6 whole black peppercorns","12 ounces tomatillos, husked, rinsed, coarsely chopped","1\/4 cup chopped white onion","1\/4 cup chopped fresh cilantro","3 medium serrano chiles, chopped with seeds","2 garlic cloves, chopped","1 teaspoon fine sea salt","6 tablespoons corn oil"],"calories":682.0,"id":83,"title":"Chicken in Green Pumpkin-Seed Sauce ","labels":["HIGHPROTEIN"]},{"sodium":20.0,"directions":["Preheat oven to 350°. Spread pistachios on a rimmed baking sheet and toast until just beginning to brown, about 4 minutes. Transfer to a plate, let cool, then coarsely chop. Spread almonds on the same baking sheet and toast until golden brown, 5-8 minutes; let cool. Set nuts aside.","Place rice in a fine-mesh sieve and rinse under cold water until water runs clear. Cook rice in a large pot of boiling salted water, stirring occasionally, until grains have lengthened but are still firm, 6-7 minutes; drain and rinse under cold water. Spread rice on another rimmed baking sheet; let cool.","Meanwhile, using a vegetable peeler, remove zest from orange and thinly slice lengthwise (reserve flesh for another use). Bring sugar and 1 cup water to a boil in a medium saucepan, stirring to dissolve sugar. Add orange zest and carrots, reduce heat, and simmer, stirring occasionally, until carrots are tender, 15-20 minutes; drain and set aside (discard syrup).","Combine barberries and raisins in a small bowl and cover with hot water; let soak 10 minutes. Drain and set aside. Place saffron in another small bowl and add 1\/4 cup hot water; set aside.","Heat butter and 1 tablespoon oil in a large skillet over medium heat. Add onion, season with salt, and cook, stirring often, until soft and beginning to brown, 8-10 minutes. Add cardamom, cumin, turmeric, and 1 tablespoon saffron mixture. Cook, stirring constantly, until fragrant, about 1 minute.","Reduce heat to low, add barberries and raisins, and cook, stirring often, about 3 minutes. Stir in reserved nuts and orange zest and carrot mixture; season with salt. Set fruit and nut mixture aside.","Heat remaining 3 tablespoons oil in a large wide heavy pot over medium heat. Add half of rice, spreading evenly; top with fruit and nut mixture, then remaining rice, spreading evenly. Using the end of a wooden spoon, poke 5-6 holes in rice all the way through to bottom of pot (to help release steam and help rice cook evenly).","Drizzle remaining saffron mixture over rice. Place a clean kitchen towel over pot, cover with a tight-fitting lid, and secure loose edges of towel on top of lid, using a rubber band or masking tape.","Cook until pot begins to steam, 5-8 minutes. Reduce heat to very low and cook, without stirring, until rice is tender and bottom layer of rice is browned and crisp, 30-40 minutes.","Scoop rice into a wide serving bowl, breaking bottom crust into pieces.","DO AHEAD: Fruit and nut mixture can be made 2 days ahead. Cover fruit and nut mixture and remaining saffron mixture separately and chill."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/54af56504074bdfd06839fe1\/6:4\/w_620%2Ch_413\/51169120_jeweled-rice_1x1.jpg","protein":28.0,"fat":162.0,"ingredients":["1\/4 cup unsalted, shelled raw natural pistachios","1\/4 cup slivered almonds","2 cups basmati rice","Kosher salt","1 orange","1\/2 cup sugar","2 medium carrots, peeled, cut into matchstick-size pieces","1\/4 cup dried barberries or 1\/2 cup dried cranberries","1\/4 cup raisins","1\/4 teaspoon saffron threads","2 tablespoons unsalted butter","4 tablespoons olive oil, divided","1 medium onion, finely chopped","1\/4 teaspoon ground cardamom","1\/4 teaspoon ground cumin","1\/4 teaspoon ground turmeric","ingredient info: Dried barberries, sold as zereshk, are available at Middle Eastern markets and kalustyans.com."],"calories":517.0,"id":84,"title":"Jeweled Rice ","labels":["LOWSODIUM"]},{"sodium":1797.0,"directions":["Mix all ingredients in a small bowl.","Rub brisket all over with spice rub. Cover and chill for at least 2 hours or overnight. Let stand at room temperature for 1 hour before continuing.","Preheat oven to 325°F. Heat 1 tablespoon oil in a large wide pot over high heat. Add brisket, fat side down. Cook undisturbed until well browned, 5-6 minutes. Turn brisket over and cook until browned, about 3 minutes. Using tongs, transfer to a plate. Reduce heat to medium and add remaining 1 tablespoon oil. Add onion and garlic. Cook, stirring occasionally, until onion is slightly golden, about 5 minutes. Add broth and all remaining ingredients. Bring liquid to a simmer. Return brisket to pot. Cover and transfer to oven.","Braise until brisket is very tender to the touch but still holds its shape, about 4 1\/2 hours. Using a large spatula, transfer brisket, fat side up, to a large plate. Strain braising liquid into a large bowl. Return liquid to pot, bring to a simmer, and cook until reduced to 2 cups, about 15 minutes. Score fat side of brisket by cutting a crosshatch pattern of 1\/4\"-deep slits spaced 1\/2\" apart. Return brisket, fat side up, to pot with reduced braising liquid. DO AHEAD: Brisket can be made 2 days ahead. Return brisket to pot, cover, and chill. Bring to a simmer and rewarm brisket before proceeding.","Transfer 1\/4 cup braising liquid to a blender. Add jam and bourbon and purée until smooth. Season with salt and pepper.","Preheat broiler. Spread 3-4 tablespoons glaze on top of brisket with the back of a spoon. Broil brisket in pot until browned and glazed, watching carefully to prevent burning, 4-5 minutes.","Transfer brisket to a cutting board. Slice against the grain and transfer to a large platter. Ladle braising liquid over. Drizzle remaining glaze on top."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/54b411dfd5e8c3e1070b0e59\/6:4\/w_620%2Ch_413\/388709_brisket_1x1.jpg","protein":180.0,"fat":486.0,"ingredients":["1 tablespoon plus 1 teaspoon kosher salt","1 teaspoon freshly ground black pepper","1\/4 teaspoon smoked paprika","1\/8 teaspoon ground cinnamon","1 4-pound trimmed flat-cut brisket with about 1\/3\" top layer of fat","2 tablespoons grapeseed oil, divided","3\/4 cup chopped onion","3 garlic cloves, smashed","4 cups beef broth","1 12-ounce bottle stout","3\/4 cup bourbon","1\/4 cup (packed) light brown sugar","1\/4 cup soy sauce","6 large sprigs thyme","3 celery stalks, chopped","2 plum tomatoes, cored, chopped","1 large carrot, chopped","1 tablespoon balsamic vinegar","1\/2 cup peach jam or preserves","2 teaspoons bourbon","Kosher salt and freshly ground black pepper","Ingredient info: Smoked paprika can be found at most supermarkets, at specialty foods stores, and at latienda.com."],"calories":856.0,"id":85,"title":"Braised Brisket with Bourbon-Peach Glaze ","labels":["HIGHPROTEIN"]},{"sodium":311.0,"directions":["Bring 5 cups water to a boil in a medium pot, season with salt, and add sorghum. Cover and cook until tender, about 1 hour. Drain well.","Place racks in upper and lower thirds of oven and set a rimmed baking sheet on lower rack; preheat oven to 400°F. Arrange squash on another rimmed baking sheet; season with salt and dot with 2 Tbsp. butter. Place on upper rack in oven. Roast, turning occasionally to recoat with butter, until tender, 40–45 minutes.","Meanwhile, rub chicken all over with oil; season with salt and pepper. Place skin side down on heated baking sheet on lower rack in oven. Roast until an instant-read thermometer inserted into the thickest part of thigh registers 165°F, 30–35 minutes.","Cook remaining 4 Tbsp. butter in a large skillet over medium heat until it foams, then browns (be careful not to let it burn), about 5 minutes. Reduce heat to medium-low; add sorghum, squash, broth, maple syrup, and vinegar to brown butter and toss to combine. Simmer until liquid is evaporated, about 4 minutes. Remove from heat and stir in lemon juice; season with salt, pepper, and more vinegar, if desired.","Divide squash and sorghum among plates and top with chicken, parsley, and pomegranate seeds."],"imageURL":"https:\/\/assets.epicurious.com\/photos\/582cc7b031bd0b471cece70d\/6:4\/w_620%2Ch_413\/roast-chicken-with-sorghum-and-squash-BA-111416.jpg","protein":252.0,"fat":693.0,"ingredients":["Kosher salt","1 cup sorghum","1\/2 large butternut squash, peeled, cut into 1-inch pieces (about 2 cups)","6 tablespoons unsalted butter, cut into small pieces, divided","4 bone-in chicken legs (thigh and drumstick; about 3 pounds total)","1 tablespoon olive oil","Freshly ground black pepper","1\/2 cup low-sodium chicken broth","1 tablespoon pure maple syrup","1 tablespoon (or more) sherry vinegar","2 tablespoons fresh lemon juice","1\/2 cup coarsely chopped parsley","1\/2 cup pomegranate seeds"],"calories":1143.0,"id":88,"title":"Roast Chicken With Sorghum and Squash ","labels":["HIGHPROTEIN"]}]